noccy80/mspdev/reference/MSP430ware/examples/boards/MSP-EXP430F5529/src/UserExperienceDemo/MenuGames.c
/*******************************************************************************
 *
 *  MenuGames.c - Allows the user to select different games.
 *
 *  Copyright (C) 2010 Texas Instruments Incorporated - http://www.ti.com/
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include "msp430.h"
#include "HAL_PMM.h"
#include "HAL_UCS.h"
#include "HAL_Buttons.h"
#include "HAL_Dogs102x6.h"
#include "HAL_Board.h"
#include "HAL_Menu.h"
#include "EchoUsb.h"
#include "MassStorage.h"
#include "Mouse.h"
#include "DemoApps.h"
#include "descriptors.h"
#include "usb.h"                                      // USB-specific functions
#include "UsbCdc.h"
#include "HAL_Wheel.h"
#include "LaunchpadDef.h"
#include "Random.h"
#include "MenuGames.h"
#include "Puzzle.h"
#include "CTS_Layer.h"

static const char *const gameMenuText[] = {
    "======Games======",
    "1. Defender ",
    "2. Simon ",
    "3. Tilt Puzzle "
};

char *strrev(char *);
char *itoa(int, char *, int);

// Forward Declared Function
void Simon(void);
void StartPuzzle(void);

/***************************************************************************//**
 * @brief  Allows user to select USB apps
 * @param  none
 * @return none
 ******************************************************************************/

void MenuGames(void)
{
    uint8_t selection = 0;

    buttonsPressed = 0;
    Dogs102x6_clearScreen();

    while (!(buttonsPressed & BUTTON_S2))
    {
        selection = Menu_active((char **)gameMenuText, 3);
        if (buttonsPressed & BUTTON_S2) break;
        switch (selection)
        {
            case 1: LaunchpadDef();  break;
            case 2: Simon();  break;
            case 3: StartPuzzle(); break;
            default:  break;
        }
    }
    buttonsPressed = 0;
    Dogs102x6_clearScreen();
}

// Simon Game
void Simon(void)
{
    uint8_t turn = 0, quit = 0, i;
    struct Element *user;

    char turndisp[2];
    //array of Simon moves
    uint8_t lights[20];

    Dogs102x6_clearScreen();
    Dogs102x6_stringDraw(0, 0, "   Simon Says:   ", DOGS102x6_DRAW_NORMAL);

    buttonsPressed = 0;

    // Initialize Cap Touch
    TI_CAPT_Init_Baseline(&slider);

    //initialize Simon's moves
    for (i = 0; i < 20; i++) lights[i] = 0;

    // Seed the random number generator with the current UCS FLL settings + i
    srand(UCSCTL0 + i);

    //menu active until selection is made
    while (!quit)
    {
        turn = turn + 1;

        Dogs102x6_stringDraw(1, 0, "     MY TURN!    ", DOGS102x6_DRAW_NORMAL);
        __delay_cycles(11000000);

        for (i = 0; i < turn; i++)
        {
            //random number from 0-4, add to Simon array
            if (i >= (turn - 1)) lights[i] = rand() % 5;

            // Overall delay between button blinks
            __delay_cycles(8000000);

            //display Simon array according to values 0-4
            if (lights[i] == 0)
            {
                Board_ledOn(LED4);
                //display so lights are slow enough for user to see
                __delay_cycles(11000000);
                //turn of LED after display
                Board_ledOff(LED4);
            }
            if (lights[i] == 1)
            {
                Board_ledOn(LED5);
                __delay_cycles(11000000);
                Board_ledOff(LED5);
            }
            if (lights[i] == 2)
            {
                Board_ledOn(LED6);
                __delay_cycles(11000000);
                Board_ledOff(LED6);
            }
            if (lights[i] == 3)
            {
                Board_ledOn(LED7);
                __delay_cycles(11000000);
                Board_ledOff(LED7);
            }
            if (lights[i] == 4)
            {
                Board_ledOn(LED8);
                __delay_cycles(11000000);
                Board_ledOff(LED8);
            }
        }

        Dogs102x6_stringDraw(1, 0, "   YOUR TURN!    ", DOGS102x6_DRAW_NORMAL);

        for (i = 0; i < turn; i++)
        {
            // wait for any user input
            while ((user = (struct Element *)TI_CAPT_Buttons(&slider)) == 0) ;
            // turn off LED after user input
            Board_ledOff(LED4);
            Board_ledOff(LED5);
            Board_ledOff(LED6);
            Board_ledOff(LED7);
            Board_ledOff(LED8);

            // compare to Simon array
            if (lights[i] == 0)
            {
                // if correct, do nothing
                if (user == (struct Element *)&element0)
                {
                    Board_ledOn(LED4);
                    // display so lights are slow enough for user to see
                    __delay_cycles(7000000);
                    // turn of LED after display
                    Board_ledOff(LED4);
                }
                // if wrong, set quit to 1
                else
                {
                    quit = 1;
                }
            }
            else if (lights[i] == 1)
            {
                if (user == (struct Element *)&element1)
                {
                    Board_ledOn(LED5);
                    // display so lights are slow enough for user to see
                    __delay_cycles(7000000);
                    // turn of LED after display
                    Board_ledOff(LED5);
                }
                else
                {
                    quit = 1;
                }
            }
            else if (lights[i] == 2)
            {
                if (user == (struct Element *)&element2)
                {
                    Board_ledOn(LED6);
                    // display so lights are slow enough for user to see
                    __delay_cycles(7000000);
                    // turn of LED after display
                    Board_ledOff(LED6);
                }
                else
                {
                    quit = 1;
                }
            }
            else if (lights[i] == 3)
            {
                if (user == (struct Element *)&element3)
                {
                    Board_ledOn(LED7);
                    // display so lights are slow enough for user to see
                    __delay_cycles(7000000);
                    // turn of LED after display
                    Board_ledOff(LED7);
                }
                else
                {
                    quit = 1;
                }
            }
            else if (lights[i] == 4)
            {
                if (user == (struct Element *)&element4)
                {
                    Board_ledOn(LED8);
                    // display so lights are slow enough for user to see
                    __delay_cycles(7000000);
                    // turn of LED after display
                    Board_ledOff(LED8);
                }
                else
                {
                    quit = 1;
                }
            }
            while ((struct Element *)TI_CAPT_Buttons(&slider) == user) ;

            // if wrong, quit immediately
            if (quit)
                break;
        }
        if (!quit){
            // good job if theyre right
            Dogs102x6_stringDraw(1, 0, "    GOOD JOB!   ", DOGS102x6_DRAW_NORMAL);
            __delay_cycles(24000000);
        }
    }
    // displayed if incorrect
    Dogs102x6_stringDraw(1, 0, "       WRONG!    ", DOGS102x6_DRAW_NORMAL);
    __delay_cycles(24000000);

