noccy80/mspdev/reference/MSP430ware/examples/boards/MSP-EXP430F5529/src/UserExperienceDemo/MenuGames.c
    // Copy the background image to the local frame buffer.
    for (a = 0; a < 8; a++)
    {
        for (count = 0; count < 102; count++)
        {
            frame[2 + a * 102 + count] = background[a][count];
        }
    }
}

/***************************************************************************//**
 * @brief Draws a image on the local frame buffer.
 * @param *image  Pointer to the image to add to the buffer
 * @param x   The horizontal position of the image
 * @param y   The vertical position of the image
 * @param width   The width of the image
 * @return none
 ******************************************************************************/

void DrawImage(const uint8_t *image, uint8_t x, uint8_t y, uint8_t width)
{
    uint8_t idx;

    // Loop through the columns of this image.
    for (idx = 0; idx < width; idx++)
    {
        // See if this column is on the display.
        if (((x + idx) >= 0) && ((x + idx) < 102))
        {
            // Add this image to the row(s) of the local frame buffer.
            frame[2 + (y / 8) * 102 + x + idx] |= image[idx] >> (y % 8);
            frame[2 + (y / 8 + 1) * 102 + x + idx] |= image[idx] << (8 - y % 8);
        }
    }
}

/***************************************************************************//**
 * @brief  Update the mines in the tunnel.
 * @param  None
 * @return none
 ******************************************************************************/

void UpdateMines(void)
{
    uint8_t count, max;
    uint32_t idx;

    // The maximum horizontal position of any mine found.
    max = 0;

    // Loop through the five possible mines.
    for (count = 0; count < 5; count++)
    {
        if ((mines[count][0] == -1) && (mines[count][1] == -1) && (mines[count][2] == -1))
        {
            // Skip this mine if it does not exist.
            continue;
        }

        // Move the mine one step to the left
        mines[count][1]--;

        // If the mine is too far off the left edge of the display then disable it.
        if (mines[count][1] == -8)
        {
            mines[count][0] = -1;
            mines[count][1] = -1;
            mines[count][2] = -1;
            continue;
        }

        // See if this mine is furthest to the right so far.
        if ((mines[count][1] + 9) > max)
        {
            // Set the new maximal mine position.
            max = mines[count][1] + 9;
        }

        // See which type of mine this is.
        if (mines[count][0] == 0)
        {
            // Draw mine type one
            DrawImage(Game_mine1, mines[count][1], mines[count][2], 6);
        }
        else
        {
            // Draw mine type twos
            DrawImage(Game_mine2, mines[count][1], mines[count][2], 8);
        }
    }

    // If there are mines too close to the right side of the display then do not
    // place any new mines.
    if (max > 85)
    {
        return;
    }

    // Only place new mines occasionally.
    idx = RandomNumber();
    if (idx >= 0x0c000000)
    {
        return;
    }

    // Try to find an unused mine entry.
    for (count = 0; count < 5; count++)
    {
        if ((mines[count][0] == -1) && (mines[count][1] == -1) && (mines[count][2] == -1))
        {
            break;
        }
    }
    if (count == 5)
    {
        // If all five mines are already in use, then a new mine can not be
        // added.
        return;
    }

    // Choose a random mine type.
    idx = NEXT_RAND(idx);
    mines[count][0] = idx >> 31;
    // The mine starts at the right edge of the display.
    mines[count][1] = 94;
    // Choose a random vertical position
    idx = NEXT_RAND(idx);
    mines[count][2] = offset[0] + idx % (64 - offset[0] - offset[1]);

    if (mines[count][0] == 0)
    {
        // Draw mine type one on the local frame buffer.
        DrawImage(Game_mine1, mines[count][1], mines[count][2], 6);
    }
    else
    {
        // Draw mine type two on the local frame buffer.
        DrawImage(Game_mine2, mines[count][1], mines[count][2], 8);
    }
}

/***************************************************************************//**
 * @brief  Move the missile further to the right, checking for impacts.
 * @param  fire The status of the fire button (0 = not pressed, 1 = pressed)
 * @param  dead The status of the ship (0 = alive, 1 = dead)
 * @return none
 ******************************************************************************/

void UpdateMissile(uint8_t fire, uint8_t dead)
{
    uint8_t bit, x;
    uint16_t pos;

    //Set the x position to zero to indicate that no impact has been detected.
    x = 0;

    // See if a missile is currently in flight.
    if ((missile[0] == -1) && (missile[1] == -1))
    {
        // No missile is in flight, so see if one should be fired.
        if (fire && !dead)
        {
            // Set the horizontal position of a newly fired missile
            missile[0] = 15;

            //Set the vertical position by the position of the ship
            pos = Wheel_getValue();
            if (pos > 0x824)
            {
                //Scale pos for size of screen. pos range is (0~63)
                pos = (0xFFF - pos) / 32;
            }
            else
            {
                pos = pos / 32;
            }

            if (pos > 56)
            {
                // Don't let ship go off bottom of screen.
                pos = 56;
            }

            missile[1] = pos + 8;
        }
        else
        {
            // do nothing because no missile fired or in flight
            return;
        }
    }

    // Move the missile to the right.
    missile[0] += 2;

    // See if the missile has moved off the display.
    if (missile[0] >= 101)
    {
        // The missile is no longer on the display, so remove it
        missile[0] = -1;
        missile[1] = -1;
        // Return without doing anything else.
        return;
    }

    // Compute the bit that contains the missile.
    bit = 0x80 >> (missile[1] % 8);

