noccy80/mspdev/reference/MSP430ware/examples/boards/MSP-EXP430F5529/src/UserExperienceDemo/MenuGames.c
    // Draw the left most column of the missile and check for an impact.
    frame[2 + (missile[1] / 8) * 102 + (missile[0] + 0)] ^= bit;
    if ((frame[2 + (missile[1] / 8) * 102 + (missile[0] + 0)] & bit) != bit)
    {
        frame[2 + (missile[1] / 8) * 102 + (missile[0] + 0)] |= bit;
        //impact location
        x = missile[0];
    }

    // Draw the middle column of the missile and check for an impact.
    frame[2 + (missile[1] / 8) * 102 + (missile[0] + 1)] ^= bit;
    if ((frame[2 + (missile[1] / 8) * 102 + (missile[0] + 1)] & bit) != bit)
    {
        frame[2 + (missile[1] / 8) * 102 + (missile[0] + 1)] |= bit;
        if (x == 0)
        {
            x = missile[0] + 1;
        }
    }

    // Draw the right column of the missile and check for an impact.  The
    // right column may be off the display, so bypass the check in that
    // case.
    if (missile[0] <= 99)
    {
        frame[2 + (missile[1] / 8) * 102 + (missile[0] + 2)] ^= bit;
        if ((frame[2 + (missile[1] / 8) * 102 + (missile[0] + 2)] & bit) != bit)
        {
            frame[2 + (missile[1] / 8) * 102 + (missile[0] + 2)] |= bit;
            if (x == 0)
            {
                x = missile[0] + 2;
            }
        }
    }

    // See if the missile hit something.
    if (x != 0)
    {
        // Loop through the mines.
        for (bit = 0; bit < 5; bit++)
        {
            // See if the missile hit this mine.
            if ((mines[bit][0] != -1) && (mines[bit][1] <= x) &&
                ((mines[bit][1] + mines[bit][0] + 7) >= x) &&
                (mines[bit][2] <= missile[1]) &&
                ((mines[bit][2] + mines[bit][0] + 7) >= missile[1]))
            {
                // This mine was struck, so remove it from the display.
                mines[bit][0] = -1;
                mines[bit][1] = -1;
                mines[bit][2] = -1;

                if (!dead)
                {
                    score += 25;
                }

                // Stop looking through the mines.
                break;
            }
        }

        // Find an empty entry in the explosion list.
        for (bit = 0; bit < 4; bit++)
        {
            if (explosions[bit][0] == -1)
            {
                break;
            }
        }

        // See if an empty entry was found.
        if (bit != 4)
        {
            // Start an explosion at the point of impact.
            explosions[bit][0] = 0;
            explosions[bit][1] = x;
            explosions[bit][2] = missile[1] - 1;
        }

        // Remove the missile from the display.
        missile[0] = -1;
        missile[1] = -1;
    }
}

/***************************************************************************//**
 * @brief  Draw the ship in its current position and check for impacts.
 * @param  None
 * @return The status of the ship (0 = alive, 1 = dead)
 ******************************************************************************/

uint8_t DrawShip(void)
{
    uint16_t pos;
    uint8_t count, bits;
    uint8_t boom;

    // Convert the wheel position to the position of the ship on the display.
    pos = Wheel_getValue();

    if (pos > 0x824)
    {
        // Scale pos for size of screen. pos range is (0~63)
        pos = (0xFFF - pos) / 32;
    }
    else
    {
        pos = pos / 32;
    }


    if (pos > 56)
    {
        // Don't let ship go off bottom of screen.
        pos = 56;
    }

    // Assume no collisions until one is found.
    boom = 0;

    // Loop through the ten columns of the ship image.
    for (count = 0; count < 10; count++)
    {
        // Find the scan lines in the first row of the ship
        bits = Game_ship[count] >> pos % 8;

        // Set the scan lines in the local frame buffer and check for an impact.
        frame[2 + (pos / 8) * 102 + (count + 5)] ^= bits;
        if ((frame[2 + (pos / 8) * 102 + (count + 5)] & bits) != bits)
        {
            // The ship hit something, so don't draw it.
            frame[2 + (pos / 8) * 102 + (count + 5)] ^= bits;
            boom = 1;
        }

        // Get the scan lines that should be set for the second row of the ship.
        bits = Game_ship[count] << (8 - pos % 8);
        if (bits)
        {
            // Set the scan lines in the local frame buffer and check for an impact.
            frame[2 + (pos / 8 + 1) * 102 + (count + 5)] ^= bits;
            if ((frame[2 + (pos / 8 + 1) * 102 + (count + 5)] & bits) != bits)
            {
                //The ship hit something, so don't draw it.
                frame[2 + (pos / 8 + 1) * 102 + (count + 5)] ^= bits;
                boom = 1;
            }
        }
    }

    // See if an impact occurred.
    if (boom)
    {
        // Start the ship explosion.
        explosions[4][0] = 0;
        explosions[4][1] = 4;
        explosions[4][2] = pos + 3;

        // Indicate that the ship has exploded.
        return (1);
    }
    else
    {
        // The ship survived, so increment the score by one.
        score++;

        // Indicate that the ship is still alive.
        return (0);
    }
}

/***************************************************************************//**
 * @brief  Draws any active explosions.
 * @param  None
 * @return none
 ******************************************************************************/

void DrawExplosions(void)
{
    uint8_t count, idx;

    // Loop through the explosion list.
    for (count = 0; count < 5; count++)
    {
        if (explosions[count][0] == -1)
        {
            // Skip this entry if it is not in use.
            continue;
        }

        // Get the index to the explosion step to display.
        idx = explosions[count][0] >> 2;

        // For all except the last explosion (i.e. the ship explosion), move
        // the explosion to the left to match the movement of the tunnel.
        if (count != 4)
        {
            explosions[count][1]--;
        }

        // Draw the explosion image into the local frame buffer.
        DrawImage(Game_explosion[idx].image,
                  explosions[count][1] - Game_explosion[idx].adjust,
                  explosions[count][2] - Game_explosion[idx].adjust,
                  Game_explosion[idx].width);

