noccy80/mspdev/reference/MSP430ware/examples/boards/MSP-EXP430F5529/src/UserExperienceDemo/MenuGames.c
        // Increment the explosion type counter.
        explosions[count][0]++;

        if (explosions[count][0] == 16)
        {
            // If the explosion has completed, then remove it from the list.
            explosions[count][0] = -1;
        }
    }
}

/***************************************************************************//**
 * @brief  Main function that plays the game.
 * @param  None
 * @return none
 ******************************************************************************/

void LaunchpadDef(void)
{
    uint32_t idx, a;
    uint8_t dead, timeout;
    uint8_t fire;
    uint8_t restart = 0;
    char scoreString[6];

    buttonsPressed = 0;
    __enable_interrupt();
    Dogs102x6_clearScreen();
    Dogs102x6_imageDraw(image, 0, 0);
    Dogs102x6_stringDraw(7, 0, "LaunchpadDefender", 0);

    //wait for button press
    while (!buttonsPressed)
    {
        // Wait in low power mode 3 until a button is pressed
        __bis_SR_register(LPM3_bits + GIE);
    }

    if (buttonsPressed & BUTTON_S1)
    {
        buttonsPressed = 0;
        while (1)
        {
            restart = 0;

            // Initialize the top and bottom wall of the tunnel to the top and
            // bottom of the display.
            offset[0] = 10;
            offset[1] = 10;

            // Turn off all the mines.
            for (idx = 0; idx < 5; idx++)
            {
                mines[idx][0] = -1;
                mines[idx][1] = -1;
                mines[idx][2] = -1;
            }

            // The missile has not been fired.
            missile[0] = -1;
            missile[1] = -1;

            // Turn off all the explosions.
            for (idx = 0; idx < 5; idx++)
            {
                explosions[idx][0] = -1;
            }

            // Reset the score to zero.
            score = 0;

            // The player is not dead yet.
            dead = 0;
            timeout = 0;

            Dogs102x6_clearScreen();

            // Clear out the background buffer.
            for (a = 0; a < 8; a++)
            {
                for (idx = 0; idx < 102; idx++)
                {
                    background[a][idx] = 0;
                }
            }

            frame[0] = 102;
            frame[1] = 8;

            // Update the tunnel background, making sure that there are at least
            // thirteen scan lines between the top and bottom walls (providing
            // room for the "Press Button To Play" text).
            UpdateBackground(40);
            Dogs102x6_imageDraw((uint8_t*)frame, 0, 0);
            buttonsPressed = 0;

            while (!restart)
            {
                // Update the tunnel.  The tunnel gets smaller as the score goes
                // up.
                UpdateBackground(30 - (score / 500));
                UpdateMines();
                if (buttonsPressed) fire = 1;
                else fire = 0;
                buttonsPressed = 0;
                if (dead)
                {
                    timeout++;
                }
                if (!dead)
                {
                    dead = DrawShip();
                    UpdateMissile(fire, dead);
                }
                DrawExplosions();
                RandomAddEntropy(score);

                Dogs102x6_imageDraw((uint8_t*)frame, 0, 0);

                if (timeout == 32)
                {
                    Dogs102x6_setInverseDisplay();
                    __delay_cycles(6000000);
                    Dogs102x6_clearInverseDisplay();
                    __delay_cycles(6000000);
                    Dogs102x6_setInverseDisplay();
                    __delay_cycles(6000000);
                    Dogs102x6_clearInverseDisplay();

                    scoreString[0] = '0' + ((score / 10000) % 10);
                    scoreString[1] = '0' + ((score / 1000) % 10);
                    scoreString[2] = '0' + ((score / 100) % 10);
                    scoreString[3] = '0' + ((score / 10) % 10);
                    scoreString[4] = '0' + (score % 10);
                    scoreString[5] = '\0';

                    Dogs102x6_clearRow(5);
                    Dogs102x6_clearRow(4);
                    Dogs102x6_clearRow(3);

                    Dogs102x6_stringDraw(2, 0, " Score:          ", DOGS102x6_DRAW_INVERT);
                    Dogs102x6_stringDraw(2, 48, scoreString, DOGS102x6_DRAW_INVERT);
                    Dogs102x6_stringDraw(3, 0, " S2: QUIT        ", DOGS102x6_DRAW_INVERT);
                    Dogs102x6_stringDraw(4, 0, " S1: PLAY AGAIN  ", DOGS102x6_DRAW_INVERT);

                    //wait for button press
                    while (!buttonsPressed)
                    {
                        // Wait in low power mode 3 until a button is pressed
                        __bis_SR_register(LPM3_bits + GIE);
                    }

                    restart = 1;
                }

                //Game gets faster and more difficult as your score increases
                if (score < 500)
                    __delay_cycles(500000);
                else if (score < 1000)
                    __delay_cycles(400000);
                else if (score < 2000)
                    __delay_cycles(300000);
                else if (score < 3000)
                    __delay_cycles(200000);
                else
                    __delay_cycles(100000);

            }
            if (buttonsPressed & BUTTON_S2)
            {
                Dogs102x6_clearScreen();
                buttonsPressed = 0;
                break;
            }
        }
    }
    else
    {
        buttonsPressed = 0;
        Dogs102x6_clearScreen();
    }
}

//*****************************************************************************

char *strrev(char *str)
{
    char *p1, *p2;

    if (!str || !*str)
        return str;

    for (p1 = str, p2 = str + strlen(str) - 1; p2 > p1; ++p1, --p2)
    {
        *p1 ^= *p2;
        *p2 ^= *p1;
        *p1 ^= *p2;
    }

    return str;
}

char *itoa(int n, char *s, int b)
{
    static char digits[] = "0123456789abcdefghijklmnopqrstuvwxyz";
    int i = 0, sign;

    if ((sign = n) < 0)
        n = -n;

    do
    {
        s[i++] = digits[n % b];
    } while ((n /= b) > 0);

    if (sign < 0)
        s[i++] = '-';
    s[i] = '\0';

    return strrev(s);
}

